## Using Python to Integrate MongoDB Data into an ETL Process
Modern Data Warehousing and Analytics solutions frequently use languages like Python or Scala to extract data from numerous sources, including relational database management systems, NoSQL database systems, real-time streaming endpoints and Data Lakes. These languages can then be used to perform many types of transformation before then loading the data into a variety of destinations including file systems and data warehouses. This data can then be consumed by data scientists or business analysts.

In this lab you will build upon the **Northwind_DW2** dimensional database from Lab 3; however, you will be integrating new data sourced from an instance of MongoDB. The new data will be concerned with new business processes; inventory and purchasing. You will continue to interact with both the source systems (MongoDB and MySQL), and the destination system (the Northwind_DW2 data warehouse) from a remote client running Python (Jupyter Notebooks). 

Just as in Lab 3, you will fetch data into Pandas DataFrames, perform all the necessary transformations in-memory on the client, and then push the newly transformed DataFrame to the RDBMS data warehouse using a Pandas function that will create the table and fill it with data with a single operation.

### Prerequisites:
#### Import the Necessary Libraries

In [31]:
import os
import json
import numpy
import datetime
import pandas as pd

import pymongo
from sqlalchemy import create_engine

#### Declare & Assign Connection Variables for the MongoDB Server, the MySQL Server & Databases with which You'll be Working

In [40]:
#mysql connection variables. Had to use the ones from lab 3 because the ones provided in lab 4 did not work
host_name = "localhost"
host_ip = "127.0.0.1"
port = "3306"
user_id = "root"
pwd = "Passw0rd123"

#mysql_uid = "root"
#mysql_pwd = "Passw0rd123"
#mysql_host = "ds2002-mysql.mysql.database.azure.com"
#mongo db connection variables
atlas_cluster_name = "cluster0.zibbf"
atlas_user_name = "maf9tga"
atlas_password = "Passw0rd123"

conn_str = {"local" : f"mongodb://localhost:27017/",
    "atlas" : f"mongodb+srv://maf9tga:Passw0rd123@cluster0.8rqtmzl.mongodb.net/?retryWrites=true&w=majority"
}

src_dbname = "sakila_rental_fact"
dst_dbname = "sakila_dw2"

print(f"Local Connection String: {conn_str['local']}")
print(f"Atlas Connection String: {conn_str['atlas']}")

Local Connection String: mongodb://localhost:27017/
Atlas Connection String: mongodb+srv://maf9tga:Passw0rd123@cluster0.8rqtmzl.mongodb.net/?retryWrites=true&w=majority

#### Define Functions for Getting Data From and Setting Data Into Databases

In [41]:
def get_sql_dataframe(user_id, pwd, host_name, db_name, sql_query):
    '''Create a connection to the MySQL database'''
    conn_str = f"mysql+pymysql://{user_id}:{pwd}@{host_name}/{db_name}"
    sqlEngine = create_engine(conn_str, pool_recycle=3600)
    
    '''Invoke the pd.read_sql() function to query the database, and fill a Pandas DataFrame.'''
    conn = sqlEngine.connect()
    dframe = pd.read_sql(sql_query, conn);
    conn.close()
    
    return dframe


def get_mongo_dataframe(connect_str, db_name, collection, query):
    '''Create a connection to MongoDB'''
    client = pymongo.MongoClient(connect_str)
    
    '''Query MongoDB, and fill a python list with documents to create a DataFrame'''
    db = client[db_name]
    dframe = pd.DataFrame(list(db[collection].find(query)))
    dframe.drop(['_id'], axis=1, inplace=True)
    client.close()
    return dframe
#used set_dataframe function from lab 3 as well
def set_dataframe(user_id, pwd, host_name, db_name, df, table_name, pk_column, db_operation):
    conn_str = f"mysql+pymysql://{user_id}:{pwd}@{host_name}/{db_name}"
    sqlEngine = create_engine(conn_str, pool_recycle=3600)
    connection = sqlEngine.connect()
    
    if db_operation == "insert":
        df.to_sql(table_name, con=connection, index=False, if_exists='replace')
        sqlEngine.execute(f"ALTER TABLE {table_name} ADD PRIMARY KEY ({pk_column});")
            
    elif db_operation == "update":
        df.to_sql(table_name, con=connection, index=False, if_exists='append')
    
    connection.close()

#def set_dataframe(user_id, pwd, db_name, host_name, df, table_name, pk_column, db_operation):
   # '''Create a connection to the MySQL database'''
   # conn_str = f"mysql+pymysql://{user_id}:{pwd}@{host_name}/{db_name}"
    #sqlEngine = create_engine(conn_str, pool_recycle=3600)
   # connection = sqlEngine.connect()
    
    '''Invoke the Pandas DataFrame .to_sql( ) function to either create, or append to, a table'''
   # if db_operation == "insert":
     #   df.to_sql(table_name, con=connection, index=False, if_exists='replace')
     #   sqlEngine.execute(f"ALTER TABLE {table_name} ADD PRIMARY KEY ({pk_column});")
            
   # elif db_operation == "update":
     #   df.to_sql(table_name, con=connection, index=False, if_exists='append')
    
   # connection.close()

#### Populate MongoDB with Source Data
You only need to run this cell once; however, the operation is *idempotent*.  In other words, it can be run multiple times without changing the end result.

In [34]:
client = pymongo.MongoClient(conn_str["atlas"])
db = client[src_dbname]

# Gets the path of the Current Working Directory for this Notebook, and then Appends the 'data' directory.
data_dir = os.path.join(os.getcwd(), 'data')

json_files = {"customer" : 'sakila_customer.json',
              "film" : 'sakila_film.json',
              "inventory" : 'sakila_inventory.json',
              "staff" : 'sakila_staff.json',
              "rental_fact" : 'rental_fact.json'
             }

for file in json_files:
    db.drop_collection(file)
    json_file = os.path.join(data_dir, json_files[file])
    with open(json_file, 'r') as openfile:
        json_object = json.load(openfile)
        file = db[file]
        result = file.insert_many(json_object)
        #print(f"{file} was successfully loaded.")

        
client.close()

### 1.0. Create and Populate the Fact Table. 
#### I have already added the dimension tables to sakila_dw2 previously. Now all I need to do is load my already made (in MySQL) fact table in
#### 1.1. Extract Data from the Source MongoDB Collections Into DataFrames

In [38]:
# TODO: Extract data from the "rental_fact" collection
query = {}
collection = "rental_fact"

df_rental_fact = get_mongo_dataframe(conn_str['atlas'], src_dbname, collection, query)
df_rental_fact.head(2)

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update,film_id,store_id,rental_rate
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2023-03-14 20:52:24,80,1,2.99
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2023-03-14 20:52:24,333,2,2.99

#### 1.3. Load the Transformed DataFrames into the New Data Warehouse by Creating New Tables

Here we will call our **set_dataframe( )** function to create each dimension table. This function expects a number of parameters including the usual connection information (e.g., user_id, password, MySQL server name and database), the *table_name* we need to assign to the table, the *pandas DataFrame* we crafted to define & populate the table, the *name* we need to assign to the *primary_key* column, and finally, the database operation (insert or update).

In [44]:
dataframe = df_rental_fact
table_name = 'rental_fact'
primary_key = 'rental_id'
db_operation = "insert"

set_dataframe(user_id, pwd, host_name, dst_dbname, dataframe, table_name, primary_key, db_operation)
#(user_id, pwd, host_name, db_name, df, table_name, pk_column, db_operation)
#host_name = "localhost"
#host_ip = "127.0.0.1"
#port = "3306"
#user_id = "root"
#pwd = "Passw0rd123"

#### 1.4. Validate that the Fact Table was Created.

In [46]:
sql_rental_fact = "SELECT * FROM sakila_dw2.rental_fact;"
df_rental_fact = get_sql_dataframe(user_id, pwd, host_name, dst_dbname, sql_rental_fact) #(user_id, pwd, host_name, db_name, sql_query)
df_rental_fact.head(2)

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update,film_id,store_id,rental_rate
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2023-03-14 20:52:24,80,1,2.99
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2023-03-14 20:52:24,333,2,2.99